/*Проблема ромба полягає в тому, що є 4 класи А,В,С,D.
  А виступає родительсим класом, B і С є наслідники класу А,
  а клас D одночасно наслідує і з класу В і С. Суть проблеми
  лежить в питанні від якого класу наслідується клас D, від B чи С? */


// Щоб полагодити код треба забрати нижче поміняти код(рішення буде дописане у вигляді коментарів)
#include <iostream>
using namespace std;

class A {
public:
	int var_A;
};

//class B : virtual public A {
class B : public A {
public:
	int var_B;
};
//class C : virtual public A {
class C : public A {
public:
	int var_C;
};

class D : public B, public C {
public:
	int var_D;
};
int main() {
	D i;

	i.var_A = 10;
	i.var_B = 20;
	i.var_C = 30;
	i.var_D = 40;
}

/*Рішенням даної проблеми є спосіб зміни наслідування класу А на віртуальне в класах В і С.
  Це буде казати компілятору про те, що зміна яка наслідується з класу А буде одна і єдина,
  тоді проблеми ромба виникати не буде того, що змінна var_A буде тільки одна, а не дві
  як це трапляється при звичайному наслідуванні*/